In [3]:
print('oioi')

oioi

In [14]:
import requests
response = requests.get('https://viacep.com.br/ws/39680000/json/').json()
response

{'cep': '39680-000',
 'logradouro': '',
 'complemento': '',
 'bairro': '',
 'localidade': 'Capelinha',
 'uf': 'MG',
 'ibge': '3112307',
 'gia': '',
 'ddd': '33',
 'siafi': '4245'}

 Return the local of CEP

In [15]:
response['localidade']

'Capelinha'

In [24]:
import pandas as pd

dados = {'Notas':[5,2,3]}
df = pd.DataFrame(data=dados)
df

   Notas
0      5
1      2
2      3

In [30]:
dataM = {'Notas1':[1,2,3,4], 'Notas2':[4,5,6,7], 'Notas3':[5,8,9,10]}
df_m = pd.DataFrame(data=dataM)
df_m

   Notas1  Notas2  Notas3
0       1       4       5
1       2       5       8
2       3       6       9
3       4       7      10

In [40]:
dataM2 = [['Lucas', 'Andre', 'Eduardo', 'Paulo'],
[23,56,89,42],
['Computer', 'Materials', 'Controler', 'eletric']
]

colunas = ['','Student', 'Score', 'Course']

df_m2 = pd.DataFrame(data = dataM2, columns=colunas)

df_m2

               Student      Score   Course
0     Lucas      Andre    Eduardo    Paulo
1        23         56         89       42
2  Computer  Materials  Controler  eletric

In [83]:
import numpy as np

index = ['Student', 'Score', 'Course']
df_m3 = pd.DataFrame(data=dataM2, index=index)
df_m3 = df_m3.transpose()
df_m3['Score'] = df_m3['Score'].astype('float64')
df_m3

   Student  Score     Course
0    Lucas   23.0   Computer
1    Andre   56.0  Materials
2  Eduardo   89.0  Controler
3    Paulo   42.0    eletric

In [87]:
df_csv = pd.read_csv('./file.csv')
df_csv

  Student  Notas
0   Lucas     10
1   Pedro      6